Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: on equalities and inequalities in cultural expression, identity and lifestyles within and between the majority and minority groups in Norway and the Sápmi/Sábme/Sáepmie
nb: over likheter og ulikheter i kulturuttrykk, identitet og levesett innenfor og mellom majoritet og minoritet i Norge og Sápmi/Sábme/Sáepmie

source: This also involves being able to explain the content and theoretical basis of public documents, as well as specialist literature in printed form and on the Internet.
nb: Det betyr også å kunne forklare innholdet og det teoretiske grunnlaget i offentlige dokumenter og faglitteratur i trykt form og på Internett.

source: It is early morning in the toddlers’ unit.
nb: Det er tidlig på morgenen på småbarnsavdelingen.

source: can never be equal to 2.
nb: aldri kan bli lik 2.

source: read and understand tables and graphic presentations
nb: lese og forstå tabeller og grafiske framstillinger

source: Researchers Kristine Toft Rosland and Audun Toft have studied kindergartens in four municipalities along the Helgeland coast in Nordland County.
nb: Forskerne Kristine Toft Rosland og Audun Toft har undersøkt barnehager i fire kommuner på Helgelandskysten i Nordland.

source: is the most basic skill in mathematics.
nb: er den mest grunnleggende ferdigheten i matematikk.

source: It is also important to have a plan for how documentation work will be followed up during the year.
nb: Det er også viktig at det finnes en plan for hvordan arbeidet med dokumentasjon skal følges opp gjennom året.

source: New Zealand, Queensland in Australia, England and Scotland
nb: New Zealand, Queensland i Australia, England og Skottland

source: In the competition to get to play games or draw on the computer, children take note of who is the owner, and who is in control.
nb: I konkurransen om å få spille eller tegne på datamaskinene, kan barn markere hvem som eier, og hvem som har kontrollen.

source: It also deals with ecology and the mutual effect between the fish farming facility and the environment.
nb: Videre handler det om økologi og den gjensidige påvirkningen mellom akvakulturanlegg og miljø.

source: describe the main features of a philosophy of life that is not based on Humanism
nb: forklare hva livssyn er og vise hvordan livssyn kommer til uttrykk på ulike måter

source: Norwegian for the Hearing Impaired is a key subject with regard to cultural understanding, communication, enlightenment and developing an identity.
nb: Norsk for døve og sterkt tunghørte er et sentralt fag for utvikling av kommunikative og formelle språkferdigheter og for kunnskapstilegnelse.

source: Marketing and management shall help pupils gain more knowledge about how an organization functions internally and externally, and shall illustrate the social responsibilities an organization should adhere to.
nb: Markedsføring og ledelse skal utvikle kunnskap om hvordan en organisasjon fungerer internt og eksternt, og synliggjøre det samfunnsansvar en organisasjon har.

source: in Mathematics involves creating meaning by listening, speaking and conversing about mathematics.
nb: i matematikk innebærer å skape mening gjennom å lytte, tale og samtale om matematikk.

source: “In kindergartens, the staff members experience that they depend on each another.”
nb: – I barnehagen opplever de ansatte derfor at de er svært avhengige av hverandre.

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics through playing, being creative, having a sense of wonder and talking about mathematics.
nb: Læreren skal legge til rette for elevmedvirkning og stimulere til lærelyst ved at elevene får utforske matematikk gjennom å leke, være kreative, undre seg og samtale om matematikk.

source: The first article was about the use of partition walls in one Danish and one Norwegian kindergarten.
nb: Den første artikkelen handlet om bruk av barnehagevegger i en dansk og en norsk barnehage.

source: The majority of knowledge we have about infection in children and young people applies to the original strain of the virus.
nb: Vikarbruk og omrokkering av personell mellom kohorter bør begrenses, men ikke på bekostning av opplæring på skolen.

source: express an opinion on various topics
nb: uttrykke egen mening om ulike emner

source: Chemistry 2 builds on Chemistry 1.
nb: Kjemi 2 bygger på kjemi 1.

source: Construction vehicle and machinery operator consists of four main subject areas.
nb: Anleggsmaskinførerfaget består av fire hovedområder.

source: Taking pleasure in writing is key to developing writing skills.
nb: Lyttefunksjonen omfatter å kunne oppfatte gjennom alle sanser, avlese og reflektere.

source: ‘The fact that researchers have a tendency to exaggerate small differences between sample groups is a methodological problem with research’, Ejrnæs contends.
nb: – Det er et metodisk problem i forskningen at forskere har en tilbøyelighet til å overdrive små forskjeller som de finner mellom grupper, mener Ejrnæs.

source: use basic rules and patterns for pronunciation, intonation, spelling, grammar and various sentence structures
nb: bruke grunnleggende regler og mønstre for uttale, intonasjon, rettskriving, grammatikk og ulike setningstyper

source: express one's own feelings and opinions
nb: uttrykke sine egne følelser og meninger

source: Curriculum for the elective subject of living cultural heritage (LKA1-01)
nb: Læreplan i valgfaget natur, miljø og friluftsliv (NMF1-01)

source: Including international perspectives in the Norwegian subject curriculum can help to develop cultural understanding, tolerance and respect for individuals from other cultures.
nb: Faget samisk som førstespråk skal sammen med faget norsk legge grunnlaget for utvikling av elevenes tospråklighet, og bidra til at den enkelte elev får kunnskaper, motivasjon og trygghet til å bevare, styrke og utvikle språket både muntlig og skriftlig.

source: Teaching in the programme subjects shall pave the way for varied assignments involving different types of facilities relevant to the industry.
nb: Opplæringen i programfagene skal legge til rette for varierte arbeidsoppgaver innenfor forskjellige anleggstyper som er relevante i bransjen.

source: The subject of Social science provides pupils with the tools to analyse, discuss and elaborate on questions about historical and contemporary societies and to identify and discuss the balance of power.
nb: Gjennom samfunnsfaget får elevene verktøy til å analysere og drøfte historiske og aktuelle samfunnsspørsmål, til å identifisere og diskutere ulike maktrelasjoner, og til å analysere urfolks og minoriteters situasjon og rettigheter.

source: explain how the use of language can offend others
nb: forklare hvordan man gjennom språk kan krenke andre

source: evaluate the opportunities for and challenges to establishing a company and illustrate some of the main features of the profit and loss accounts and balance sheet
nb: vurdere muligheter for og utfordringer ved å etablere en bedrift og trekke ut hovedlinjene i et resultat- og balanseregnskap

source: in Norwegian is a basic skill that the Norwegian subject curriculum takes special responsibility for, through initial reading training and continuing this training throughout all the 13 years of schooling.
nb: i norsk er en grunnleggende ferdighet som norskfaget tar et særskilt ansvar for gjennom den første leseopplæringen og den videre leseopplæringen som foregår gjennom hele det 13-årige løpet.

source: Aids and technologies are used in most mathematical activities.
nb: I det meste av matematisk aktivitet benyttes hjelpemidler og teknologi.

source: in English involves understanding, exploring and pondering demanding texts, thereby gaining insight across cultures and special fields.
nb: i engelsk innebærer å forstå, utforske og reflektere over krevende tekster, og slik skaffe seg innsikt på tvers av kulturer og fagfelt.

source: give an account of organizational theories, and use them to assess the hallmarks of a good working environment
nb: gjøre rede for organisasjonsteorier og bruke teoriene til å vurdere kjennetegn ved et godt arbeidsmiljø

source: The pupils demonstrate and develop competence in the subject in year 6 when they use mathematical terminology in communication and argumentation.
nb: Elevene viser og utvikler kompetanse i faget på 6. trinn når de bruker matematiske begreper i kommunikasjon og argumentasjon.

source: At this kindergarten, all the children were to be encouraged to climb up onto their chairs themselves.
nb: I denne barnehagen skulle alle barna oppfordres til selv å klatre opp i den.

source: Evaluating one’s own language learning in terms of a set of goals is also included in the main subject area.
nb: Vurdering av egen språklæring i forhold til oppsatte mål inngår i hovedområdet.

source: plan and carry out studies in some nature areas in cooperation with others
nb: planlegge og gjennomføre undersøkelser i noen naturområder i samarbeid med andre

source: calculate probability by counting all favourable and all possible results based on tables and by systematising counts using cross tables, venn diagrams and the addition rule and the multiplication principle in practical contexts
nb: beregne sannsynlighet ved å telle opp gunstige og mulige utfall, systematisere opptellinger ved hjelp av krysstabeller, venndiagrammer og valgtre og bruke addisjonssetningen og produktsetningen

source: use different media, sources and aesthetic expressions in own Sign Language texts and multidisciplinary texts
nb: bruke tegnspråktekster og annen bilde- og tekstinformasjon hentet fra bibliotek, Internett og massemedier og utvise kildekritikk og referere til benyttede kilder

source: analyse basic differences between the political parties in Norway
nb: analysere grunnleggende forskjeller mellom politiske partier og grupperinger i samisk og i norsk politikk

source: on how identity, self-image and one’s own boundaries are developed and challenged in different environments, and
nb: over hvordan identitet, selvbilde og egne grenser utvikles og utfordres i ulike fellesskap, og

source: She has interviewed children and adults in kindergartens, asking how they use technology and what they think about it.
nb: Hun har gjort intervjuer med barn og voksne i barnehager, og spurt om hvordan de bruker teknologi, og hva de selv synes om det.

source: This means obtaining, processing and presenting mathematical information in electronic form.
nb: Det innebærer også å hente, bearbeide og presentere matematisk informasjon i elektronisk form.

source: in Social science involve being able to understand, describe, compare and analyse sources and problems using facts, theories, definitions and technical terms through debates, presentations and in expressing one’s opinion.
nb: i samfunnsfag innebærer å kunne forstå, beskrive, sammenlikne og analysere kilder og problemstillinger ved å bruke fakta, teorier, definisjoner og fagbegreper i innlegg, presentasjoner og meningsytringer.

source: The central element in the subject area is the structure of organic substances and how they react.
nb: Det sentrale i hovedområdet er hvordan organiske stoffer er bygd opp, og hvordan stoffene reagerer.

source: The kindergarten was part of the project “Ergonomics and pedagogy hand in hand – Health in every movement”.
nb: Barnehagen deltok i prosjektet «Ergonomi og pedagogikk hånd i hånd – Helse i hver bevegelse».

source: discuss how to prepare and give presentations in situations where an interpreter is required
nb: bruke kunnskap om språk og tekst i utforskende og vurderende samtaler om original tegnspråktekst

source: identify some linguistic similarities and differences between English and the native language
nb: identifisere noen språklige likheter og forskjeller mellom engelsk og eget morsmål

source: read and understand different types of text
nb: lese og forstå ulike typer tekster

source: This main subject area covers the multicultural society and the role of religion in culture.
nb: Hovedområdet omfatter samspill mellom og tilhørighet i ulike kulturer, samfunn og religioner.

source: The reason for absence can be given on the certificate.
nb: i mat og helse kan være å beskrive smak, lukt og estetikk.

source: give an account of key similarities and differences between Old Norse and modern Norwegian
nb: velge og bruke innhold fra ulike kilder på en selvstendig, kritisk og ansvarlig måte

source: The kindergarten has been identified as a particular important arena for early effort.
nb: Barnehagen er blitt identifisert som en spesielt viktig arena for tidlig innsats.

source: The subject shall also help them better understand how money and financial policies can be used to achieve economic and political objectives.
nb: Videre skal faget utvikle forståelse for hvordan penge- og finanspolitiske virkemidler kan brukes for å nå økonomiske og politiske målsettinger.

source: Værum Sørensen found that all three of the Danish preschools she studied offered plenty of physical activity.
nb: Værum Sørensen fant at alle de tre danske barnehagene hun studerte, hadde gode rammer for fysisk aktivitet.

source: create a summary of different news media presentations of natural disasters, and evaluate the geoscientific descriptions critically
nb: lage sammendrag av ulike mediers presentasjon av en naturkatastrofe og vurdere kritisk de geofaglige beskrivelsene

source: The pupils shall also reflect on how politics, conflicts, economics, technology and the use of resources are interwoven and have impact on groups in society.
nb: Elevene skal også få innsikt i hvordan religioner og livssyn inngår i historiske prosesser og henger sammen med samfunnsendringer og kulturarv.

source: Labour law and equal opportunities
nb: Historieforståelse og metoder

source: She made video observations of 20 five-year-olds and three kindergarten teachers.
nb: Hun har gjort videoobservasjon av 20 femåringer og tre barnehagelærere.

source: interpretations of the past are affected by our understanding of the present and expectations for the future
nb: mat og brukt naturressurser, og vurdere betydningen av dette for mennesker og et bærekraftig samfunn

source: in Social science involves being able to express oneself, assert one’s ideas and provide the grounds for one’s point of view, and to communicate and share this knowledge in written form.
nb: i samfunnsfag innebærer å kunne uttrykke, grunngi og argumentere for standpunkter, og formidle og dele kunnskap skriftlig.

source: Chemists research, determine and describe how substances are built up at a micro level, and on this basis explain their properties and how substances react.
nb: Kjemikere utforsker, bestemmer og beskriver hvordan stoffer er oppbygd på mikronivå, og forklarer på dette grunnlaget stoffenes egenskaper og reaksjoner.

source: describe the form, function and inner differentiation of cities, and discuss the ways in which this affects the living conditions of population groups
nb: beskrive byers form, funksjon og indre differensiering og diskutere hvordan dette påvirker bybefolkningens levekår

source: Thus they gain experiences which enable pupils to learn and perceive and to understand themselves and society.
nb: Dermed får de erfaringer som gir mulighet for læring og opplevelse og for å forstå seg selv og å kunne delta i samfunnet.

source: The pupils shall be able to participate in planning, carrying out and assessing their education within the framework provided by the Act and regulations, including the National Curriculum.
nb: Elevene skal kunne delta i planlegging, gjennomføring og vurdering av opplæringen innenfor rammen av lov og forskrift herunder læreplanverket.

source: The main subject area
nb: utforsking av språket i bruk

source: 20 per cent of their time on administration, planning and documentation.
nb: 20 prosent av tiden sin til administrasjon, planleggingsarbeid og dokumentasjon.

source: understand the main content and details of texts one has chosen
nb: lese og tolke eksperimenterende og modernistiske tekster

source: recycling, and use different tools and materials in an appropriate and environmentally friendly way.
nb: gjenbruk, og bruke ulike verktøy og materialer på en hensiktsmessig og miljøbevisst måte

source: identify and use various situations to expand his/her own English-language skills
nb: identifisere og bruke ulike situasjoner og strategier for å utvide egne ferdigheter i engelsk

source: and up to the present day have contributed to oppression, terror and such genocides as the Holocaust
nb: til i dag har bidratt til undertrykkelse, terror og folkemord som holocaust

source: employ basic structures for sentence structure and cohesion
nb: bruke grunnleggende strukturer for setningsbygging og tekstbinding

source: The grade is also based on how the pupil reflects on aesthetic expression, cultural references, function and durability in their own work and the work of others.
nb: Karakteren skal også være basert på hvordan eleven reflekterer over estetiske uttrykk, kulturelle referanser, funksjon og holdbarhet i egne og andres arbeider.

source: elaborate on and discuss how communication is affected by social factors such as power, gender, age and social and economic background
nb: drøfte hvordan kommunikasjon påvirkes av sosiale faktorer, som makt, kjønn, alder og sosial og økonomisk bakgrunn

source: revolves around written communication and the development of reading and writing skills.
nb: Utvikling og utvidelse av ordforråd og begreper i ulike fag og temaer inngår i hovedområdet.

source: explain how trade and economic systems have affected power
nb: Å utforske handler om å oppleve og eksperimentere og kan ivareta nysgjerrighet og undring.

source: The programme subject shall give an introduction to numbers theory, complex numbers, and probability and statistics.
nb: Programfaget skal gi en innføring i tallteori, komplekse tall og sannsynlighet og statistikk.

source: The main subject area Democracy and co-citizenship deals with continuity in and breach of democratic traditions and the requisite conditions for citizenship and democratic forms of government.
nb: dreier seg om kontinuitet i og brudd på demokratiske tradisjoner og nødvendige betingelser for medborgerskap og demokratiske styreformer.

source: define social development issues and analyse them with the aid of qualitative data and methods
nb: formulere problemstillinger om samfunnsutvikling og analysere dem ved hjelp av kvalitative data og metoder

source: Exploiting information from graphs, tables and statistics is important for understanding English texts.
nb: Å utnytte informasjon fra grafiske framstillinger, tabeller og statistikker er viktig for forståelse av engelske tekster.

source: ‘Only 32 per cent of the staff in Norwegian kindergartens have kindergarten teachers’ training.
nb: Bare 32 prosent av personalet i norske barnehager har barnehagelærerutdanning.

source: The subject shall also make pupils better attuned to issues concerning the use of resources, the environment and sustainable development.
nb: Ved bruk av varierte metoder og ulike læringsarenaer skal opplæringen i faget stimulere til nysgjerrighet, kreativitet og samarbeid.

source: talk about ethnic, religious and ethical minorities in Norway, and reflect on the challenges of multicultural society
nb: samtale om etniske minoriteter i Norge og reflektere over holdninger knyttet til det flerkulturelle samfunnet

source: They also demonstrate and develop competence in mathematics when reasoning about and arguing for procedures and solutions.
nb: Videre viser og utvikler de kompetanse i matematikk når de resonnerer over og argumenterer for framgangsmåter og løsninger.

source: give an account of the use of English as a universal world language
nb: gjøre rede for bruken av engelsk som et internasjonalt verdensspråk

source: plan and present trips to Europe and other regions of the world using digital tools
nb: planlegge og presentere reiser til Europa og andre verdensdeler ved å bruke digitale verktøy

source: describe the main characteristics of the Norwegian economy and how our economy is connected to the global economy
nb: beskrive hovedtrekk ved norsk økonomi og hvordan den henger sammen med global økonomi

source: tell about Plato and Aristotle, and discuss some of their ideas
nb: fortelle om Platon og Aristoteles og diskutere noen av deres ideer

source: Most children experience a high degree of well-being in ECEC institutions, but roughly 10 per cent report the opposite.
nb: De fleste barna har det godt i barnehagen, men rundt 10 prosent svarer at de trives dårlig.

source: points out the need for more knowledge
nb: Vi ser at for å realisere en helhetlig

source: explain the Hindu calendar of festivals and describe Hindu festivals and central rituals
nb: forklare hinduistisk høytidskalender og beskrive hinduistiske høytider og sentrale ritualer

source: Suddenly the kindergarten teacher Håkon Sakshaug runs fast over the yard.
nb: Plutselig kommer barnehagelærer Håkon Sakshaug løpende i full fart over barnehageplassen.

source: compare irony and humour in different languages
nb: samtale om hvordan språk kan uttrykke og skape holdninger til enkeltindivider og grupper

source: collect and systematise information and describe some extinct animal species and groups of animals and how they lived
nb: samle og systematisere informasjon og beskrive noen utdødde dyrearter og dyregrupper og hvordan de levde

source: The pupils also develop and demonstrate competence in the History subject when they identify connections in the past and between the past and present and when they reflect on how the context in which people lived influenced their way of thinking and choice of actions.
nb: Elevene utvikler og viser videre kompetanse når de presenterer ulike perspektiver på fortidige hendelser, og når de reflekterer over hvordan framstillinger av fortiden brukes og hvordan fortiden bidrar til å prege dem selv som mennesker.

source: The main subject areas complement each other, and must be viewed in relation to one another.
nb: Hovedområdene utfyller hverandre og må sees i sammenheng.

source: Islam and an elective religion
nb: islam og en valgfri religion

source: In vocational education programmes and in education programmes for sports and music, dance and drama, the social studies subject has competence aims after VG2.
nb: I yrkesfaglige utdanningsprogram og i utdanningsprogram for idrettsfag og musikk, dans og drama har samfunnsfag kompetansemål etter Vg2.

source: Should the displays prompt memories or actions?
nb: Skal det gjenkalle eller fremkalle handlinger?

source: The model, as we see it, aims at developing an overall structure for cross-sectoral coherent follow-up, based on the need of children and young people.
nb: Dette kan betegnes som performativ kompetanse, og favner bredere enn kun å vurdere elevene basert på den informasjonen de gjengir og dokumenterer.

source: Curriculum T is more theoretical, while Curriculum P is more practical.
nb: T-varianten er mer teoretisk orientert, mens P-varianten er mer praktisk orientert.

source: The doctor-cum-researcher examined 23 kindergartens in two Danish municipalities.
nb: Legen og forskeren har undersøkt 23 barnehager i to danske kommuner.

source: write texts with a clear structure and a clear focus and argumentation based on facts
nb: skrive klart disponerte tekster med tydelig fokus og saklig argumentasjon

source: Reading literature may also help to instil the joy of reading in pupils and provide the basis for personal growth, maturity and creativity.
nb: Samtidig kan litteraturlesing bidra til leseglede og opplevelse og legge grunnlag for ens egen personlige vekst, modning og kreativitet.
